<details ><summary>apply for core 2025-03-04 18:35:40 (UTC)</summary>
    <details ><summary>Locking successful</summary>
  Project LumeWeb/lumeportal.com-devops#core has been locked by PR #1
</details>

<details ><summary>Apply output</summary>

```terraform
OpenTofu will perform the following actions:

  # cloudns_dns_record.renterd will be created
  + resource "cloudns_dns_record" "renterd" {
      + id    = (known after apply)
      + name  = "lumeportal-core-renterd-solo.node"
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "lumeportal.com"
    }

  # cloudns_dns_record.renterd_s3 will be created
  + resource "cloudns_dns_record" "renterd_s3" {
      + id    = (known after apply)
      + name  = (known after apply)
      + ttl   = 600
      + type  = "CNAME"
      + value = (known after apply)
      + zone  = "lumeportal.com"
    }

  # module.renterd.module.renterd_deployment.akash_deployment.service will be created
  + resource "akash_deployment" "service" {
      + deployment_dseq               = (known after apply)
      + deployment_gseq               = (known after apply)
      + deployment_oseq               = (known after apply)
      + deployment_owner              = (known after apply)
      + deployment_state              = (known after apply)
      + escrow_account_balance_amount = (known after apply)
      + escrow_account_balance_denom  = (known after apply)
      + escrow_account_owner          = (known after apply)
      + id                            = (known after apply)
      + last_updated                  = (known after apply)
      + provider_address              = (known after apply)
      + sdl                           = (sensitive value)
      + services                      = (known after apply)

      + provider_filters {
          + enforce   = true
          + providers = [
              + "akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn",
            ]
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + renterd_s3_endpoint = (known after apply)
module.renterd.module.renterd_deployment.akash_deployment.service: Creating...
module.renterd.module.renterd_deployment.akash_deployment.service: Still creating... [10s elapsed]
module.renterd.module.renterd_deployment.akash_deployment.service: Still creating... [20s elapsed]
module.renterd.module.renterd_deployment.akash_deployment.service: Creation complete after 25s [id=20494958:1:1:akash1nd8v8nc9ufzguwg3yu4fm9q02q72r6y4fhwkg2:akash1jukxttwauvnty679l720ey87ya5sgjv4j9tstn]
cloudns_dns_record.renterd: Creating...
cloudns_dns_record.renterd_s3: Creating...
cloudns_dns_record.renterd: Creation complete after 1s [id=583905066]
cloudns_dns_record.renterd_s3: Creation complete after 1s [id=583905068]

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.

Outputs:

base_domain = "lumeportal.com"
environment = "prod"
etcd_endpoint = "http://provider.ny-01.node.infra.lumeweb.com:31265"
etcd_password = <sensitive>
etcd_username = <sensitive>
mysql_endpoint = "provider.ny-01.node.infra.lumeweb.com:30157"
renterd_endpoint = "lumeportal-core-renterd-solo.node.lumeportal.com"
renterd_s3_endpoint = "lumeportal-core-renterd-solo.node.lumeportal.com:30759"

```
</details>

</details>